[{"title":"Introducing LayerZero V2","text":"<p>All told, with the launch of V2, LayerZero aims to embed itself as a crypto primitive on par with Bitcoin and Ethereum. Bitcoin as the protocol for crypto money, Ethereum as the protocol for crypto finance, and LayerZero as the protocol for crypto internet.<br>With DVNs and Adapters, LayerZero V2 sits at the transport layer of the blockchain economy, whereas other “cross-chain” solutions battle for the right to verify messages. LayerZero can now act as a quasi-aggregator of verification methods. Any type of verification method — be it bridge, oracle, attestation service, or a blockchain itself — can be plugged into V2 as a DVN. Application owners building on LayerZero may configure DVNs based on their project’s use case.<br><br>For example, application developers can opt to verify messages through shared-security adapters like Axelar and CCIP or go with enterprise signers like Blockdaemon and Google Cloud — or a combination of all four. And, most importantly, this decision is not set in stone, as the Security Stack configuration can be changed by the application owner (or a delegate) if a DAO or business decides to do so. Independent DVNs confirmed at testnet launch will include entities run by Blockdaemon, Google Cloud, Animoca, Delegate, Gitcoin, Nethermind, P2P, StableLab, Switchboard, Tapioca, LayerZero Labs, and Polyhedra. The number of DVNs should increase as mainnet approaches — with 50+ chains to support, there is a need for many DVNs.<br><br>Permissionless execution and lazy nonce-enforcement improve both liveness and throughput properties. Liveness concerns are minimized since anyone (third-party executor, application, end-user) may now execute transactions. Throughput is maximized to align with that of the destination chain. In addition, the protocol itself is easier to build on, with new design patterns available for developers to send, receive, and compose messages across chains. Furthermore, the core protocol is built in such a way that extending to new chains — even non-EVM chains — can be done without changing how messages are sent.<br><br>V2 Launch Details<br>LayerZero V2 endpoint contracts are deployed on 40+ testnets starting today, with the goal being to give developers time to experiment with new Security Stacks and Endpoints before going live on mainnet.<br><br>You can read the whitepaper here.<br>You can read the developer docs here.<br>Mainnet launch is targeted for January 2024. The launch will include V2 endpoints on each chain that V1 supports. All Omnichain contract standards — OApp, OFT, and ONFT — will be available by mainnet launch. On testnet, only OApp and OFT will be available.<br><br>Mainnet launch will include support from the following infrastructure entities:<br><br>DVNs: Instructions on how to run a DVN are available in the LayerZero documentation. Read more here. In addition, Animoca, Blockdaemon, Delegate, Gitcoin, Nethermind, Obol, P2P, StableLab, Switchboard, Tapioca, Polyhedra, LayerZero Labs, and Google Cloud will run DVNs on testnet. Adapters for Axelar and CCIP will also be available for testnet and mainnet launch, with more coming soon.<br>Executors: Instructions on how to spin up an Executor are available in LayerZero documentation. Read more here. In addition, LayerZero Labs will offer third-party execution options for dApps. LayerZero Scan will also have a tab available for end-user execution.</p>","short_text":"<p>Introducing LayerZero V2</p>","slug":"introducing-layerzero-v2","image":"https://miro.medium.com/v2/resize:fit:1358/format:webp/0*nSEojpy03DInV0A2","created_at":"19 December 2023","created_by":"FURI"}]
